import 'package:flutter/material.dart';

class Product {
  final String image, title, description,subtitle,location;


  Product({
    required this.image,
    required this.title,
    required this.description,
    required this.subtitle,
    required this.location
  });
}

List<Product> products = [
  Product(
      image: "assets/images/bangkok.jpg",
      title: "วัดพระเเก้ว",
      description:
      "วัดคู่บ้านคู่เมืองของประเทศไทย และกรุงรัตนโกสินทร์ ก็คือวัดพระศรีรัตนศาสดารามหรือวัดพระเเก้ว เป็นวัดในพระบรมมหาราชวังเช่นเดียวกับวัดพระศรีสรรเพชญ์ ซึ่งเป็นวัดในพระราชวังหลวงในสมัยอยุธยา",
      subtitle: "กรุงเทพ",
      location:"ถนนหน้าพระลาน แขวงพระบรมมหาราชวัง เขตพระนคร กรุงเทพมหานคร"
  ),
  Product(
      image: "assets/images/trang.jpg",
      title: "เกาะมุก",
      description:
      "เกาะมุก ได้ชื่อว่า “ถ้ำมรกตอันล้ำค่าแห่งอันดามัน” เป็นเกาะที่ใหญ่เป็นอันดับที่ 3 ของท้องทะเลตรัง นอกจากชาดหาดที่สวยงามแล้ว เกาะมุกยังมีจุดเด่นที่ถ้ำมรกต ถ้ำน้ำเล็กๆ ซึ่งมีความยาวประมาณ 80 เมตร นักท่องเที่ยวจะต้องลอยตัวฝ่าความมืดเพื่อเข้าไปภายในถ้ำและต้องเป็นช่วงเวลาน้ำลงเท่านั้น ภายในถ้ำน้ำทะเลจะมีสีเขียวคล้ายมรกตสวยงามอลังการ",
      subtitle: "ตรัง",
      location:"เกาะมุก ตำบลเกาะลิบง อำเภอกันตัง จังหวัดตรัง"
      ),
  Product(
      image: "assets/images/rai.jpg",
      title: "เชียงคาน",
      description:
      "เชียงคาน เมืองที่ยังคงความสวยงามด้วยสถาปัตยกรรมโบราณดั้งเดิม เป็นที่ดึงดูดใจของนักท่องเที่ยวมาทุกยุคทุกสมัย ตรอกเล็กๆ ริมน้ำโขงแห่งนี้จะมีนักท่องเที่ยวทุกมุมโลกมาเยี่ยมเยียนอย่างไม่ขาดสาย และที่สำคัญเป็นเมืองท่องเที่ยวที่สามารถไปเที่ยวได้ในทุกช่วงเวลาทั้งหน้าร้อน หน้าฝน โดยเฉพาะอย่างยิ่งในหน้าหนาว",
      subtitle: "เลย",
      location:"ตำบลเชียงคาน อำเภอเชียงคาน จังหวัดเลย"
  ),
  Product(
      image: "assets/images/phuket.jpg",
      title: "เกาะไม้ท่อน",
      description:
      "Honeymoon Island หรือ เกาะไม้ท่อน เกาะส่วนตัวที่มองจากด้านบนอากาศลงมาแล้วจะเห็นเป็นรูปท่อนไม้ จึงเป็นที่มาของเกาะไม้ท่อน ด้วยความที่เป็นเกาะส่วนตัวเลยทำให้นักท่องเที่ยวที่มาเที่ยวพักผ่อนที่นี่ต่อวันมีไม่มากนัก ความอุดมสมบูรณ์ของธรรมชาติเลยมีให้เห็นเช่นนี้",
      subtitle: "ภูเก็ต",
      location:"ตำบลราไวย์ อำเภอเมือง จังหวัดภูเก็ต"
  ),
  Product(
      image: "assets/images/p.jpg",
      title: "หมู่เกาะกำ",
      description:
      " หมู่เกาะกำ เป็นหมู่เกาะที่อยู่ในพื้นที่ของอุทยานแห่งชาติแหลมสน ที่นี่เป็นหมู่เกาะที่มีความสวยงาม น้ำทะเลใส และหาดทรายขาว เป็นจุดดำน้ำตื้น, เล่นน้ำ ของเหล่านักท่องเที่ยวอีกแห่งหนึ่งค่ะ ซึ่งสามารถไปเที่ยวที่นี่ได้ด้วยโปรแกรมนำเที่ยวหมู่เกาะกำแบบไปเช้าเย็นกลับ สามารถเช่าเหมาเรือหางยาวของชาวบ้าน",
      subtitle: "ระนอง",
      location:"หมู่เกาะกำ อุทยานแห่งชาติแหลมสน ต.ม่วงกลวง อ.กะเปอร์ จ.ระนอง"
  ),
  Product(
      image: "assets/images/puchifha.jpg",
      title: "ภูชี้ฟ้า",
      description:
      "ภูชี้ฟ้า เป็นยอดเขาสูงที่สุดในเทือกเขาดอยผาหม่น ติดชายแดนไทย-ลาว ค่ะ ตั้งอยู่ในอำเภอเทิง จังหวัดเชียงราย ด้วยความมีเอกลักษณ์ทางธรรมชาติของลักษณะหน้าผาปลายยอดแหลม เป็นแนวยาวที่ชี้ไปบนฟ้าทางฝั่งประเทศลาว จึงเป็นที่มาของชื่อเรียกว่า “ภูชี้ฟ้า” ",
      subtitle: "เชียงราย",
      location:"อุทยานแห่งชาติภูชี้ฟ้า ตำบลตับเต่า อำเภอเทิง จังหวัดเชียงราย"
  ),
  Product(
      image: "assets/images/trad.jpg",
      title: "เกาะหวาย",
      description:
      "เกาะหวาย อยู่ห่างจากเกาะช้างเพียง 40 นาที สามารถขึ้นเรือได้ที่ท่าเรือบางเบ้าบนเกาะช้าง หรือจะขึ้นมาจากอ.แหลมงอบ (ท่าเรือกรมหลวงชุมพร) ก็ได้ ต้องบอกก่อนว่าถ้าอยากจะเห็นปะการังสีสวยๆ สดๆ จะต้องออกไปไกลจากหาดสักหน่อย ส่วนใหญ่จะเป็นปะการังเขากวาง และปะการังพุ่ม แต่จะต้องระวังหอยเม่นด้วยเพราะบริเวณนี้ค่อนข้างจะชุกชุม แต่ก็เป็นสิ่งยืนยันความสมบูรณ์ของท้องทะเลที่นี่ได้เป็นอย่างดี",
      subtitle: "ตราด",
      location:"ตำบลเกาะช้างใต้ อำเภอเกาะช้าง จังหวัดตราด"
  ),
  Product(
      image: "assets/images/hong.jpg",
      title: "เกาะห้อง",
      description:
      "ที่นักท่องเที่ยวนิยมมาพายแคนูมากที่สุด ในอ่าวพังงานั้นก็คือเกาะห้อง ซึ่งจะเป็นเกาะที่ประกอบด้วยภูเขาหินปูนลูกน้อยใหญ่เรียงตัวโอบล้อมผืนทะเลไว้ในลักษณะเกือบจะเป็นทรงกลมคล้ายกับห้องขนาดใหญ่จึงเรียกกันว่า “เกาะห้อง” จุดเด่นของการมาเที่ยวเกาะห้องก็คือ ช่วงเวลาน้ำลงเราจะสามารถเดินเลียบเลาะไปตามแนวสันทรายบริเวณขอบรอบๆ เกาะห้องได้ จะได้ความรู้สึกเหมือนได้เล่นน้ำท่ามกลางสระว่ายน้ำธรรมชาติขนาดใหญ่ทีเดียว",
      subtitle: "กระบี่",
      location:"หมู่เกาะห้อง อุทยานแห่งชาติธารโบกขรณี อ.อ่าวลึก จ.กระบี่"
  ),
  Product(
      image: "assets/images/chaingmai.jpg",
      title: "น้ำพุร้อนฝาง",
      description:
      "น้ำพุร้อนฝาง ตั้งอยู่ในอุทยานแห่งชาติดอยผ้าห่มปก ซึ่งมีความอุดมสมบูรณ์ทางธรรมชาติมาก บ่อน้ำพุร้อนมีมากกว่า 50 บ่อ กระจายไปทั่วพื้นที่ และมีขนาดใหญ่เล็กแตกต่างกันไป อุณหภูมิสูงประมาณ 90 องศาเซลเซียส มีบริการบ่อแช่น้ำแร่อาบน้ำแร่แบบส่วนตัว อุณหภูมิอุ่นพอดีช่วยให้สบายตัวและดีต่อผิวพรรณ นอกจากนี้ยังมีบ่อต้มไข่ไว้ให้อิ่มอร่อยกันอีกด้วย",
      subtitle: "เชียงใหม่",
      location:"อุทยานแห่งชาติดอยฟ้าห่มปก ตำบลบ้านปิน อำเภอฝาง จังหวัดเชียงใหม่"
  ),
  Product(
      image: "assets/images/corofield.jpg",
      title: "วัดพระบาทปู่ผาแดง",
      description:
      "อีกหนึ่ง Unseen Thailand ที่ไม่ควรพลาด วัดเฉลิมพระเกียรติพระจอมเกล้าราชานุสรณ์ หรือ วัดพระบาทปู่ผาแดง ในอำเภอแจ้ห่ม จังหวัดลำปาง วัดแห่งนี้ตั้งอยู่บนยอดเขา หรือดอยปู่ยักษ์ ในพื้นที่เขตห้ามล่าสัตว์ป่าดอยพระบาท มีรอยพระพุทธบาทประดิษฐานอยู่ และมีเจดีย์ตั้งอยู่บนยอดเขาเป็นเอกลักษณ์ที่โดดเด่น",
      subtitle: "ลำปาง",
      location:"อำเภอแจ้ห่ม จังหวัดลำปาง"
  ),
];